app/views/lists/show.html.erb


<!-- <%Tag.all.each do |t| %>
---
SELECT "list_tags".* FROM "list_tags"
SELECT "tags".* FROM "tags"