app/controllers/items_controller.rb

  def create
    # binding.pry
    @list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]