app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "a   "], ["list_id", 1], ["created_at", "2018-07-22 19:47:33.548382"], ["updated_at", "2018-07-22 19:47:33.548382"]]
---
  def create
    @list = List.find_by(id: params[:list_id])
    @item = @list.items.build(item_params)

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2018-07-19 01:48:27.191482"], ["id", 2]]
---
  def update

    @item = Item.find_by(id: params[:id])
    @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["level", 5], ["updated_at", "2018-07-25 16:31:53.146066"], ["id", 3]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 6]]
---
  def destroy
    @item = Item.find_by(id: params[:id])
    newlevel = @item.list.user.level +=1

    @item.list.user.update_attribute(:level, newlevel)
    @item.destroy