app/controllers/lists_controller.rb

  def create

    @user = User.find_by(id: session[:user_id])
    @list = @user.lists.create(list_params)
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "My list"], ["created_at", "2018-07-17 17:17:41.737570"], ["updated_at", "2018-07-17 17:17:41.737570"]]