app/controllers/lists_controller.rb

  def index
    if @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def show
    @user = User.find_by(id: params[:user_id])
    @list = List.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.find_by(id: session[:user_id])
    @list = @user.lists.create(list_params)
    # creates a list associated with user
    #each list++, so no overlap with other users-
    # find by list and you will get the user, other people cant see a list that isnt theirs
    if @list.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lists" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Amazon List"], ["created_at", "2018-07-22 19:40:46.941394"], ["updated_at", "2018-07-22 19:40:46.941394"], ["user_id", 1]]
INSERT INTO "lists" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Bucket List"], ["created_at", "2018-07-25 02:56:09.422846"], ["updated_at", "2018-07-25 02:56:09.422846"], ["user_id", 3]]