app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "tony"], ["LIMIT", 1]]
---
  def create
    if auth_hash = request.env["omniauth.auth"]
      oauth_email = auth_hash["info"]["email"]
      oatuh_nickname = auth_hash["info"]["nickname"]
      if @user = User.find_by(:email => oauth_email)
        session[:user_id] = @user.id
        redirect_to "/users/#{@user.id}/lists"
      else
        @user = User.new(:email => oauth_email, :password => SecureRandom.hex)
        if @user.save
          session[:user_id] = @user.id
          redirect_to "/users/#{@user.id}/lists"
        else

        end
      end
    end


    @user = User.find_by(name: params[:user][:name])