app/controllers/tags_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "list_tags" ("tag_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 9], ["list_id", 6], ["created_at", "2018-07-19 23:25:42.220443"], ["updated_at", "2018-07-19 23:25:42.220443"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "some item"], ["created_at", "2018-07-19 22:39:01.534590"], ["updated_at", "2018-07-19 22:39:01.534590"]]
INSERT INTO "list_tags" ("tag_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 22], ["list_id", 18], ["created_at", "2018-07-20 18:05:58.995391"], ["updated_at", "2018-07-20 18:05:58.995391"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "new item"], ["created_at", "2018-07-19 22:53:53.108778"], ["updated_at", "2018-07-19 22:53:53.108778"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "another tag"], ["created_at", "2018-07-19 23:32:01.243345"], ["updated_at", "2018-07-19 23:32:01.243345"]]
INSERT INTO "list_tags" ("tag_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 14], ["list_id", 17], ["created_at", "2018-07-20 17:58:17.435497"], ["updated_at", "2018-07-20 17:58:17.435497"]]
SELECT  "list_tags".* FROM "list_tags" WHERE "list_tags"."tag_id" = ? AND "list_tags"."list_id" = ? LIMIT ?  [["tag_id", 14], ["list_id", 17], ["LIMIT", 1]]
---
  def create
    # binding.pry
    @list = List.find(params[:list_id], params[:user_id])# has user_id
    @tag = Tag.new(tag_params)
    if @tag.save # can be saved(new)
      @list_tag = ListTag.create(tag_id: @tag.id, list_id: params[:list_id])
      redirect_to "/users/#{params[:user_id]}/lists/#{params[:list_id]}"
    elsif !!(Tag.find_by(tag_params))#(cant be saved, but it exists)
      @found_tag = Tag.find_by(tag_params)
      @list_tag = ListTag.find_or_create_by(tag_id: @found_tag.id, list_id: params[:list_id])