app/controllers/users_controller.rb

  def items
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    @user = User.create(user_params)
    if User.find_by(name: params[:user][:name]) || @user.valid?
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "candy"], ["LIMIT", 1]]